---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/articles/wsp-recall/programs/final/1-descri
> ptive/2-wsp-diar-diagnostics.log
  log type:  text
 opened on:  24 May 2012, 12:16:00

. 
. 
. *---------------------------------------------
. * Program      : 2-wsp-diar-diagnostics
. * Programmer   : Ben Arnold
. * Date         : 8 Jun 2010
. * Description  :
. /*
> 
> Summarize diarrhea characteristics for 
> WSP datasets to inform recall calculations
> and simulations.
> 
> */
. *---------------------------------------------
. 
. *---------------------------------------------
. * Major updates / modifications to the code:
. *
. * 15 July 2011 simplified to exclude processing
. *---------------------------------------------
. 
. 
. 
. set mem 500m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are
    performed on the fly automatically.

. 
. 
. 
. *---------------------------------------------
. * Program to calculate summary stats
. *---------------------------------------------
. 
. capture program drop diarsum

. program define diarsum
  1. version 9
  2. 
. *--------------------------------------------
. * Summarize length for cases that terminated
. * in the 7 d prior to the interview
. *--------------------------------------------
. 
. 
. di as res _n "Reported diarrhea episode length"
  3. tab diarlencat if agemth<24 & diar00==0 & diar07pp==1
  4. 
. di as res _n "Reported diarrhea episode length (untruncated)"
  5. tab diarlen if agemth<24 & diar00==0 & diar07pp==1
  6. 
. di as res _n "Mean episode length"
  7. sum diarlen if agemth<24 & diarlen<30 & diar00==0 & diar07pp==1, d
  8. 
. 
. *--------------------------------------------
. * Summarize point and period prevalence
. * among children <=24 months
. *--------------------------------------------
. 
. di as res "Point prevalence means"
  9. sum diar00 - diar14 if agemth <24
 10. 
. 
. di as res "Period prevalence means"
 11. sum diar*pp if agemth <24
 12. 
. 
. end diarsum

. 
. 
. 
. *---------------------------------------------
. * Calculate summary stats for each country
. *---------------------------------------------
. 
. * INDIA HP
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="India HP"
(10133 observations deleted)

. diarsum

Reported diarrhea episode length

   Diarrhea |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14       14.00       14.00
          2 |         41       41.00       55.00
          3 |         22       22.00       77.00
          4 |          9        9.00       86.00
          5 |          7        7.00       93.00
          6 |          1        1.00       94.00
          7 |          2        2.00       96.00
          8 |          1        1.00       97.00
          9 |          1        1.00       98.00
         10 |          1        1.00       99.00
         13 |          1        1.00      100.00
------------+-----------------------------------
      Total |        100      100.00

Reported diarrhea episode length (untruncated)

       diar |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         14       14.00       14.00
          2 |         41       41.00       55.00
          3 |         22       22.00       77.00
          4 |          9        9.00       86.00
          5 |          7        7.00       93.00
          6 |          1        1.00       94.00
          7 |          2        2.00       96.00
          8 |          1        1.00       97.00
          9 |          1        1.00       98.00
         10 |          1        1.00       99.00
         13 |          1        1.00      100.00
------------+-----------------------------------
      Total |        100      100.00

Mean episode length

                  diar episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 100
25%            2              1       Sum of Wgt.         100

50%            2                      Mean               2.93
                        Largest       Std. Dev.      1.970771
75%            3              8
90%            5              9       Variance       3.883939
95%            7             10       Skewness       2.429474
99%         11.5             13       Kurtosis       10.68841
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      diar00 |      2058     .016035    .1256405          0          1
      diar01 |      2058    .0252672    .1569738          0          1
      diar02 |      2058    .0306122    .1723066          0          1
      diar03 |      2058    .0286686    .1669139          0          1
      diar04 |      2058    .0204082    .1414263          0          1
-------------+--------------------------------------------------------
      diar05 |      2058    .0204082    .1414263          0          1
      diar06 |      2058    .0194363    .1380863          0          1
      diar07 |      2058    .0189504    .1363831          0          1
      diar08 |      2058    .0126336    .1117143          0          1
      diar09 |      2058      .01069    .1028633          0          1
-------------+--------------------------------------------------------
      diar10 |      2058    .0111759    .1051493          0          1
      diar11 |      2058    .0048591    .0695545          0          1
      diar12 |      2058    .0048591    .0695545          0          1
      diar13 |      2058    .0043732    .0660013          0          1
      diar14 |      2058    .0043732    .0660013          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    diar01pp |      2058    .0252672    .1569738          0          1
    diar02pp |      2058    .0340136    .1813082          0          1
    diar03pp |      2058    .0417881    .2001533          0          1
    diar04pp |      2058    .0461613    .2098853          0          1
    diar05pp |      2058    .0515063    .2210818          0          1
-------------+--------------------------------------------------------
    diar06pp |      2058    .0578231    .2334654          0          1
    diar07pp |      2058    .0626822    .2424494          0          1
    diar08pp |      2058    .0631681    .2433242          0          1
    diar09pp |      2058    .0660836    .2484885          0          1
    diar10pp |      2058    .0680272    .2518538          0          1
-------------+--------------------------------------------------------
    diar11pp |      2058    .0680272    .2518538          0          1
    diar12pp |      2058    .0680272    .2518538          0          1
    diar13pp |      2058    .0694849    .2543388          0          1
    diar14pp |      2058    .0694849    .2543388          0          1

. 
. 
. * INDIA MP
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="India MP"
(10038 observations deleted)

. diarsum

Reported diarrhea episode length

   Diarrhea |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17        7.59        7.59
          2 |         51       22.77       30.36
          3 |         52       23.21       53.57
          4 |         45       20.09       73.66
          5 |         22        9.82       83.48
          6 |         14        6.25       89.73
          7 |          5        2.23       91.96
          8 |          9        4.02       95.98
          9 |          5        2.23       98.21
         10 |          1        0.45       98.66
         11 |          1        0.45       99.11
         13 |          1        0.45       99.55
         14 |          1        0.45      100.00
------------+-----------------------------------
      Total |        224      100.00

Reported diarrhea episode length (untruncated)

       diar |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         17        7.59        7.59
          2 |         51       22.77       30.36
          3 |         52       23.21       53.57
          4 |         45       20.09       73.66
          5 |         22        9.82       83.48
          6 |         14        6.25       89.73
          7 |          5        2.23       91.96
          8 |          9        4.02       95.98
          9 |          5        2.23       98.21
         10 |          1        0.45       98.66
         11 |          1        0.45       99.11
         13 |          1        0.45       99.55
         14 |          1        0.45      100.00
------------+-----------------------------------
      Total |        224      100.00

Mean episode length

                  diar episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs                 224
25%            2              1       Sum of Wgt.         224

50%            3                      Mean           3.790179
                        Largest       Std. Dev.      2.177276
75%            5             10
90%            7             11       Variance       4.740531
95%            8             13       Skewness       1.526863
99%           11             14       Kurtosis       6.263003
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      diar00 |      2153    .0413377    .1991162          0          1
      diar01 |      2153      .06549     .247446          0          1
      diar02 |      2153    .0798885    .2711835          0          1
      diar03 |      2153    .0747794    .2630961          0          1
      diar04 |      2153    .0636321    .2441532          0          1
-------------+--------------------------------------------------------
      diar05 |      2153    .0640966    .2449819          0          1
      diar06 |      2153    .0617743     .240801          0          1
      diar07 |      2153    .0659545    .2482602          0          1
      diar08 |      2153    .0566651    .2312553          0          1
      diar09 |      2153    .0380864    .1914493          0          1
-------------+--------------------------------------------------------
      diar10 |      2153    .0311194    .1736806          0          1
      diar11 |      2153    .0227589    .1491687          0          1
      diar12 |      2153    .0269392    .1619433          0          1
      diar13 |      2153    .0241523    .1535577          0          1
      diar14 |      2153    .0209011    .1430864          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    diar01pp |      2153      .06549     .247446          0          1
    diar02pp |      2153     .088249    .2837225          0          1
    diar03pp |      2153    .1003251    .3005028          0          1
    diar04pp |      2153    .1124013    .3159329          0          1
    diar05pp |      2153    .1258709    .3317808          0          1
-------------+--------------------------------------------------------
    diar06pp |      2153    .1337668    .3404807          0          1
    diar07pp |      2153    .1439851    .3511562          0          1
    diar08pp |      2153    .1523456     .359439          0          1
    diar09pp |      2153    .1565258    .3634375          0          1
    diar10pp |      2153    .1593126    .3660523          0          1
-------------+--------------------------------------------------------
    diar11pp |      2153    .1634928    .3699006          0          1
    diar12pp |      2153    .1695309    .3753073          0          1
    diar13pp |      2153    .1727822    .3781467          0          1
    diar14pp |      2153    .1727822    .3781467          0          1

. 
. 
. * INDONESIA
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Indonesia"
(10093 observations deleted)

. diarsum

Reported diarrhea episode length

   Diarrhea |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         30       26.55       26.55
          2 |         29       25.66       52.21
          3 |         21       18.58       70.80
          4 |         13       11.50       82.30
          5 |          5        4.42       86.73
          6 |          5        4.42       91.15
          7 |          3        2.65       93.81
          8 |          6        5.31       99.12
         10 |          1        0.88      100.00
------------+-----------------------------------
      Total |        113      100.00

Reported diarrhea episode length (untruncated)

       diar |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         30       26.55       26.55
          2 |         29       25.66       52.21
          3 |         21       18.58       70.80
          4 |         13       11.50       82.30
          5 |          5        4.42       86.73
          6 |          5        4.42       91.15
          7 |          3        2.65       93.81
          8 |          6        5.31       99.12
         10 |          1        0.88      100.00
------------+-----------------------------------
      Total |        113      100.00

Mean episode length

                  diar episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 113
25%            1              1       Sum of Wgt.         113

50%            2                      Mean           2.982301
                        Largest       Std. Dev.       2.05714
75%            4              8
90%            6              8       Variance       4.231827
95%            8              8       Skewness       1.266284
99%            8             10       Kurtosis       4.030274
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      diar00 |      2098     .029552    .1693881          0          1
      diar01 |      2098    .0405148    .1972102          0          1
      diar02 |      2098    .0367016     .188073          0          1
      diar03 |      2098    .0367016     .188073          0          1
      diar04 |      2098     .029552    .1693881          0          1
-------------+--------------------------------------------------------
      diar05 |      2098    .0271687    .1626136          0          1
      diar06 |      2098    .0262154    .1598135          0          1
      diar07 |      2098    .0309819    .1733099          0          1
      diar08 |      2098    .0157293    .1244558          0          1
      diar09 |      2098     .014776    .1206838          0          1
-------------+--------------------------------------------------------
      diar10 |      2098    .0152526    .1225852          0          1
      diar11 |      2098    .0104862     .101888          0          1
      diar12 |      2098    .0090562     .094755          0          1
      diar13 |      2098     .008103    .0896723          0          1
      diar14 |      2098    .0090562     .094755          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    diar01pp |      2098    .0405148    .1972102          0          1
    diar02pp |      2098    .0476644    .2131061          0          1
    diar03pp |      2098    .0586273    .2349818          0          1
    diar04pp |      2098    .0624404    .2420114          0          1
    diar05pp |      2098    .0672069    .2504396          0          1
-------------+--------------------------------------------------------
    diar06pp |      2098    .0719733    .2585053          0          1
    diar07pp |      2098    .0815062    .2736762          0          1
    diar08pp |      2098    .0843661    .2780023          0          1
    diar09pp |      2098    .0862726    .2808332          0          1
    diar10pp |      2098    .0891325    .2850028          0          1
-------------+--------------------------------------------------------
    diar11pp |      2098    .0910391    .2877333          0          1
    diar12pp |      2098     .092469     .289756          0          1
    diar13pp |      2098    .0929457    .2904255          0          1
    diar14pp |      2098     .093899    .2917576          0          1

. 
. 
. * PERU
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Peru"
(8483 observations deleted)

. diarsum

Reported diarrhea episode length

   Diarrhea |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         44        8.98        8.98
          2 |        112       22.86       31.84
          3 |        135       27.55       59.39
          4 |         90       18.37       77.76
          5 |         37        7.55       85.31
          6 |         17        3.47       88.78
          7 |         20        4.08       92.86
          8 |         20        4.08       96.94
          9 |          4        0.82       97.76
         10 |          1        0.20       97.96
         12 |          2        0.41       98.37
         14 |          8        1.63      100.00
------------+-----------------------------------
      Total |        490      100.00

Reported diarrhea episode length (untruncated)

       diar |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         44        8.98        8.98
          2 |        112       22.86       31.84
          3 |        135       27.55       59.39
          4 |         90       18.37       77.76
          5 |         37        7.55       85.31
          6 |         17        3.47       88.78
          7 |         20        4.08       92.86
          8 |         20        4.08       96.94
          9 |          4        0.82       97.76
         10 |          1        0.20       97.96
         12 |          2        0.41       98.37
         14 |          7        1.43       99.80
         92 |          1        0.20      100.00
------------+-----------------------------------
      Total |        490      100.00

Mean episode length

                  diar episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs                 489
25%            2              1       Sum of Wgt.         489

50%            3                      Mean           3.656442
                        Largest       Std. Dev.       2.25899
75%            4             14
90%            7             14       Variance       5.103037
95%            8             14       Skewness       1.975259
99%           14             14       Kurtosis       8.516963
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      diar00 |      3708    .0536677    .2253913          0          1
      diar01 |      3708    .0830636    .2760156          0          1
      diar02 |      3708    .0854908    .2796484          0          1
      diar03 |      3708    .0889968    .2847775          0          1
      diar04 |      3708     .078479    .2689601          0          1
-------------+--------------------------------------------------------
      diar05 |      3708    .0717368    .2580864          0          1
      diar06 |      3708    .0717368    .2580864          0          1
      diar07 |      3708    .0717368    .2580864          0          1
      diar08 |      3708    .0382956    .1919348          0          1
      diar09 |      3708    .0272384    .1627993          0          1
-------------+--------------------------------------------------------
      diar10 |      3708    .0234628    .1513884          0          1
      diar11 |      3708    .0186084    .1351557          0          1
      diar12 |      3708    .0213053    .1444195          0          1
      diar13 |      3708    .0204962    .1417094          0          1
      diar14 |      3708    .0194175    .1380057          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    diar01pp |      3708    .0830636    .2760156          0          1
    diar02pp |      3708    .1035599    .3047298          0          1
    diar03pp |      3708    .1256742    .3315265          0          1
    diar04pp |      3708    .1432039    .3503279          0          1
    diar05pp |      3708    .1569579    .3638102          0          1
-------------+--------------------------------------------------------
    diar06pp |      3708    .1704423    .3760716          0          1
    diar07pp |      3708    .1833873    .3870359          0          1
    diar08pp |      3708    .1874326     .390311          0          1
    diar09pp |      3708    .1898598    .3922429          0          1
    diar10pp |      3708    .1925566    .3943609          0          1
-------------+--------------------------------------------------------
    diar11pp |      3708    .1939051    .3954087          0          1
    diar12pp |      3708     .197411    .3980988          0          1
    diar13pp |      3708    .1992988     .399527          0          1
    diar14pp |      3708    .2009169    .4007401          0          1

. 
. 
. * SENEGAL
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Senegal"
(10017 observations deleted)

. diarsum

Reported diarrhea episode length

   Diarrhea |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         25       11.31       11.31
          2 |         47       21.27       32.58
          3 |         52       23.53       56.11
          4 |         41       18.55       74.66
          5 |         17        7.69       82.35
          6 |          8        3.62       85.97
          7 |          9        4.07       90.05
          8 |          6        2.71       92.76
          9 |          5        2.26       95.02
         10 |          1        0.45       95.48
         11 |          1        0.45       95.93
         12 |          3        1.36       97.29
         13 |          1        0.45       97.74
         14 |          5        2.26      100.00
------------+-----------------------------------
      Total |        221      100.00

Reported diarrhea episode length (untruncated)

       diar |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         25       11.31       11.31
          2 |         47       21.27       32.58
          3 |         52       23.53       56.11
          4 |         41       18.55       74.66
          5 |         17        7.69       82.35
          6 |          8        3.62       85.97
          7 |          9        4.07       90.05
          8 |          6        2.71       92.76
          9 |          5        2.26       95.02
         10 |          1        0.45       95.48
         11 |          1        0.45       95.93
         12 |          3        1.36       97.29
         13 |          1        0.45       97.74
         14 |          3        1.36       99.10
         28 |          1        0.45       99.55
         44 |          1        0.45      100.00
------------+-----------------------------------
      Total |        221      100.00

Mean episode length

                  diar episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 220
25%            2              1       Sum of Wgt.         220

50%            3                      Mean           3.945455
                        Largest       Std. Dev.      3.059043
75%          4.5             14
90%            7             14       Variance       9.357742
95%            9             14       Skewness       3.231674
99%           14             28       Kurtosis       20.79927
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
      diar00 |      2174    .0446182    .2065116          0          1
      diar01 |      2174    .0791168    .2699831          0          1
      diar02 |      2174    .0901564    .2864716          0          1
      diar03 |      2174    .0864765    .2811311          0          1
      diar04 |      2174    .0699172    .2550661          0          1
-------------+--------------------------------------------------------
      diar05 |      2174    .0634775    .2438759          0          1
      diar06 |      2174    .0542778    .2266172          0          1
      diar07 |      2174    .0473781    .2124952          0          1
      diar08 |      2174    .0381785     .191671          0          1
      diar09 |      2174    .0326587    .1777826          0          1
-------------+--------------------------------------------------------
      diar10 |      2174    .0280589    .1651791          0          1
      diar11 |      2174    .0202392    .1408499          0          1
      diar12 |      2174    .0202392    .1408499          0          1
      diar13 |      2174    .0188592    .1360591          0          1
      diar14 |      2174    .0183993    .1344211          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
    diar01pp |      2174    .0791168    .2699831          0          1
    diar02pp |      2174     .099356    .2992083          0          1
    diar03pp |      2174    .1113155    .3145949          0          1
    diar04pp |      2174    .1209752    .3261734          0          1
    diar05pp |      2174    .1297148    .3360667          0          1
-------------+--------------------------------------------------------
    diar06pp |      2174    .1370745    .3440051          0          1
    diar07pp |      2174    .1444342    .3516104          0          1
    diar08pp |      2174    .1471941    .3543808          0          1
    diar09pp |      2174     .150414     .357559          0          1
    diar10pp |      2174    .1522539    .3593495          0          1
-------------+--------------------------------------------------------
    diar11pp |      2174    .1540938    .3611217          0          1
    diar12pp |      2174    .1563937    .3633118          0          1
    diar13pp |      2174    .1577737    .3646125          0          1
    diar14pp |      2174    .1586937    .3654742          0          1

. 
. log close
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/articles/wsp-recall/programs/final/1-descri
> ptive/2-wsp-diar-diagnostics.log
  log type:  text
 closed on:  24 May 2012, 12:16:00
---------------------------------------------------------------------------------
