---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/articles/wsp-recall/programs/final/1-descri
> ptive/3-wsp-fever-diagnostics.log
  log type:  text
 opened on:  24 May 2012, 12:16:26

. 
. 
. *---------------------------------------------
. * Program      : 3-wsp-fever-diagnostics
. * Programmer   : Ben Arnold
. * Date         : 3 Mar 2011
. * Description  :
. /*
> 
> Summarize diarrhea characteristics for 
> WSP datasets to inform recall calculations
> and simulations.
> 
> */
. *---------------------------------------------
. 
. *---------------------------------------------
. * Major updates / modifications to the code:
. *
. * 
. *---------------------------------------------
. 
. 
. 
. set mem 500m
set memory ignored.
    Memory no longer needs to be set in modern Statas; memory adjustments are
    performed on the fly automatically.

. 
. 
. 
. *---------------------------------------------
. * Program to calculate summary stats
. *---------------------------------------------
. 
. capture program drop feversum

. program define feversum
  1. version 9
  2.         
. *--------------------------------------------
. * Summarize length for cases that terminated
. * in the 7 d prior to the interview
. *--------------------------------------------
.         
. di as res _n "Reported fever episode length"
  3. tab feverlencat if agemth<24  & fever00==0 & fever07pp==1
  4. 
. di as res _n "Reported fever episode length (untruncated)"
  5. tab feverlen if agemth<24 & fever00==0 & fever07pp==1
  6. 
. di as res _n "Mean Fever episode length"
  7. sum feverlen if agemth<24 & feverlen<30 & fever00==0 & fever07pp==1, d
  8. 
. 
. 
. 
. *--------------------------------------------
. * Summarize point and period prevalence
. * among children <=24 months
. *--------------------------------------------
. 
. di as res "Point prevalence means"
  9. sum fever00 - fever14 if agemth <24
 10. 
. 
. di as res "Period prevalence means"
 11. sum fever*pp if agemth <24
 12. 
. 
. end feversum

. 
. 
. 
. *---------------------------------------------
. * Calculate summary stats for each country
. *---------------------------------------------
. 
. * INDIA HP
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="India HP"
(10133 observations deleted)

. feversum

Reported fever episode length

      Fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -5 |          2        0.48        0.48
          1 |         14        3.36        3.84
          2 |        125       29.98       33.81
          3 |        121       29.02       62.83
          4 |         63       15.11       77.94
          5 |         42       10.07       88.01
          6 |         16        3.84       91.85
          7 |         15        3.60       95.44
          8 |          8        1.92       97.36
          9 |          3        0.72       98.08
         10 |          6        1.44       99.52
         13 |          1        0.24       99.76
         14 |          1        0.24      100.00
------------+-----------------------------------
      Total |        417      100.00

Reported fever episode length (untruncated)

      fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -5 |          2        0.48        0.48
          1 |         14        3.36        3.84
          2 |        125       29.98       33.81
          3 |        121       29.02       62.83
          4 |         63       15.11       77.94
          5 |         42       10.07       88.01
          6 |         16        3.84       91.85
          7 |         15        3.60       95.44
          8 |          8        1.92       97.36
          9 |          3        0.72       98.08
         10 |          6        1.44       99.52
         13 |          1        0.24       99.76
         14 |          1        0.24      100.00
------------+-----------------------------------
      Total |        417      100.00

Mean Fever episode length

                 fever episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             -5
 5%            2             -5
10%            2              1       Obs                 417
25%            2              1       Sum of Wgt.         417

50%            3                      Mean           3.496403
                        Largest       Std. Dev.      1.988092
75%            4             10
90%            6             10       Variance       3.952511
95%            7             13       Skewness       1.245753
99%           10             14       Kurtosis       7.991976
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     fever00 |      2058     .090379    .2867937          0          1
     fever01 |      2058     .127794    .3339414          0          1
     fever02 |      2058    .1448008    .3519854          0          1
     fever03 |      2058     .143829    .3510015          0          1
     fever04 |      2058    .1326531    .3392818          0          1
-------------+--------------------------------------------------------
     fever05 |      2058    .1268222    .3328545          0          1
     fever06 |      2058    .1156463     .319878          0          1
     fever07 |      2058    .1025267    .3034135          0          1
     fever08 |      2058    .0631681    .2433242          0          1
     fever09 |      2058    .0573372    .2325423          0          1
-------------+--------------------------------------------------------
     fever10 |      2058    .0524781    .2230434          0          1
     fever11 |      2058    .0393586    .1944939          0          1
     fever12 |      2058    .0403304    .1967808          0          1
     fever13 |      2058    .0369291    .1886335          0          1
     fever14 |      2058    .0349854    .1837875          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   fever01pp |      2058     .127794    .3339414          0          1
   fever02pp |      2058    .1622935    .3688094          0          1
   fever03pp |      2058     .196793    .3976712          0          1
   fever04pp |      2058    .2254616    .4179875          0          1
   fever05pp |      2058    .2512148    .4338172          0          1
-------------+--------------------------------------------------------
   fever06pp |      2058     .276482    .4473667          0          1
   fever07pp |      2058    .2915452    .4545844          0          1
   fever08pp |      2058    .2964043    .4567824          0          1
   fever09pp |      2058    .3051506    .4605831          0          1
   fever10pp |      2058    .3119534    .4634035          0          1
-------------+--------------------------------------------------------
   fever11pp |      2058    .3197279    .4664844          0          1
   fever12pp |      2058    .3275024    .4694163          0          1
   fever13pp |      2058    .3328474     .471347          0          1
   fever14pp |      2058    .3333333    .4715191          0          1

. 
. 
. * INDIA MP
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="India MP"
(10038 observations deleted)

. feversum

Reported fever episode length

      Fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -6 |          1        0.29        0.29
          1 |         26        7.51        7.80
          2 |         68       19.65       27.46
          3 |         93       26.88       54.34
          4 |         79       22.83       77.17
          5 |         31        8.96       86.13
          6 |         10        2.89       89.02
          7 |          7        2.02       91.04
          8 |          7        2.02       93.06
          9 |         14        4.05       97.11
         10 |          2        0.58       97.69
         11 |          1        0.29       97.98
         12 |          2        0.58       98.55
         13 |          3        0.87       99.42
         14 |          2        0.58      100.00
------------+-----------------------------------
      Total |        346      100.00

Reported fever episode length (untruncated)

      fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -6 |          1        0.29        0.29
          1 |         26        7.51        7.80
          2 |         68       19.65       27.46
          3 |         93       26.88       54.34
          4 |         79       22.83       77.17
          5 |         31        8.96       86.13
          6 |         10        2.89       89.02
          7 |          7        2.02       91.04
          8 |          7        2.02       93.06
          9 |         14        4.05       97.11
         10 |          2        0.58       97.69
         11 |          1        0.29       97.98
         12 |          2        0.58       98.55
         13 |          3        0.87       99.42
         14 |          2        0.58      100.00
------------+-----------------------------------
      Total |        346      100.00

Mean Fever episode length

                 fever episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             -6
 5%            1              1
10%            2              1       Obs                 346
25%            2              1       Sum of Wgt.         346

50%            3                      Mean           3.812139
                        Largest       Std. Dev.      2.392494
75%            4             13
90%            7             13       Variance       5.724026
95%            9             14       Skewness       1.538894
99%           13             14       Kurtosis        7.31892
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     fever00 |      2153    .0575941    .2330283          0          1
     fever01 |      2153    .0840687    .2775553          0          1
     fever02 |      2153    .1035764     .304781          0          1
     fever03 |      2153    .1105434    .3136388          0          1
     fever04 |      2153    .0947515    .2929394          0          1
-------------+--------------------------------------------------------
     fever05 |      2153    .0947515    .2929394          0          1
     fever06 |      2153    .0859266    .2803208          0          1
     fever07 |      2153    .0910358    .2877268          0          1
     fever08 |      2153    .0715281    .2577648          0          1
     fever09 |      2153     .050627    .2192858          0          1
-------------+--------------------------------------------------------
     fever10 |      2153    .0427311    .2022971          0          1
     fever11 |      2153    .0380864    .1914493          0          1
     fever12 |      2153    .0469113     .211498          0          1
     fever13 |      2153    .0455179    .2084855          0          1
     fever14 |      2153    .0441245    .2054193          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   fever01pp |      2153    .0840687    .2775553          0          1
   fever02pp |      2153    .1198328    .3248414          0          1
   fever03pp |      2153    .1481654    .3553463          0          1
   fever04pp |      2153    .1625639     .369053          0          1
   fever05pp |      2153    .1862517    .3894001          0          1
-------------+--------------------------------------------------------
   fever06pp |      2153    .2011147    .4009267          0          1
   fever07pp |      2153       .2183    .4131881          0          1
   fever08pp |      2153    .2271249    .4190713          0          1
   fever09pp |      2153    .2382722    .4261254          0          1
   fever10pp |      2153    .2438458    .4295005          0          1
-------------+--------------------------------------------------------
   fever11pp |      2153    .2545286    .4356971          0          1
   fever12pp |      2153    .2670692    .4425316          0          1
   fever13pp |      2153    .2749652    .4466005          0          1
   fever14pp |      2153     .276823    .4475322          0          1

. 
. 
. * INDONESIA
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Indonesia"
(10093 observations deleted)

. feversum

Reported fever episode length

      Fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -3 |          1        0.19        0.19
         -1 |          1        0.19        0.37
          0 |          1        0.19        0.56
          1 |         86       16.10       16.67
          2 |        144       26.97       43.63
          3 |        132       24.72       68.35
          4 |         60       11.24       79.59
          5 |         35        6.55       86.14
          6 |         14        2.62       88.76
          7 |         22        4.12       92.88
          8 |         20        3.75       96.63
          9 |          6        1.12       97.75
         11 |          5        0.94       98.69
         12 |          1        0.19       98.88
         13 |          2        0.37       99.25
         14 |          4        0.75      100.00
------------+-----------------------------------
      Total |        534      100.00

Reported fever episode length (untruncated)

      fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
         -3 |          1        0.19        0.19
         -1 |          1        0.19        0.37
          0 |          1        0.19        0.56
          1 |         86       16.10       16.67
          2 |        144       26.97       43.63
          3 |        132       24.72       68.35
          4 |         60       11.24       79.59
          5 |         35        6.55       86.14
          6 |         14        2.62       88.76
          7 |         22        4.12       92.88
          8 |         20        3.75       96.63
          9 |          6        1.12       97.75
         11 |          5        0.94       98.69
         12 |          1        0.19       98.88
         13 |          2        0.37       99.25
         14 |          3        0.56       99.81
         15 |          1        0.19      100.00
------------+-----------------------------------
      Total |        534      100.00

Mean Fever episode length

                 fever episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             -3
 5%            1             -1
10%            1              0       Obs                 534
25%            2              1       Sum of Wgt.         534

50%            3                      Mean           3.338951
                        Largest       Std. Dev.      2.368354
75%            4             14
90%            7             14       Variance       5.609099
95%            8             14       Skewness       1.799876
99%           13             15       Kurtosis       7.359658
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     fever00 |      2098    .0672069    .2504396          0          1
     fever01 |      2098     .128694    .3349408          0          1
     fever02 |      2098    .1425167    .3496626          0          1
     fever03 |      2098    .1329838    .3396382          0          1
     fever04 |      2098     .113918    .3177874          0          1
-------------+--------------------------------------------------------
     fever05 |      2098     .120591     .325729          0          1
     fever06 |      2098    .1167779     .321232          0          1
     fever07 |      2098    .1277407    .3338804          0          1
     fever08 |      2098    .0591039    .2358753          0          1
     fever09 |      2098    .0481411    .2141153          0          1
-------------+--------------------------------------------------------
     fever10 |      2098    .0457579    .2090093          0          1
     fever11 |      2098    .0333651    .1796309          0          1
     fever12 |      2098    .0371783    .1892435          0          1
     fever13 |      2098    .0381316    .1915595          0          1
     fever14 |      2098     .036225     .186894          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   fever01pp |      2098     .128694    .3349408          0          1
   fever02pp |      2098    .1696854    .3754457          0          1
   fever03pp |      2098    .1973308     .398079          0          1
   fever04pp |      2098    .2240229    .4170366          0          1
   fever05pp |      2098     .257388    .4372992          0          1
-------------+--------------------------------------------------------
   fever06pp |      2098    .2826501    .4503951          0          1
   fever07pp |      2098    .3145853    .4644612          0          1
   fever08pp |      2098    .3222116     .467435          0          1
   fever09pp |      2098    .3288847      .46992          0          1
   fever10pp |      2098    .3369876    .4727933          0          1
-------------+--------------------------------------------------------
   fever11pp |      2098    .3422307    .4745695          0          1
   fever12pp |      2098    .3503337    .4771881          0          1
   fever13pp |      2098    .3551001    .4786577          0          1
   fever14pp |      2098    .3574833    .4793731          0          1

. 
. 
. * PERU
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Peru"
(8483 observations deleted)

. feversum

Reported fever episode length

      Fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        252       32.73       32.73
          2 |        270       35.06       67.79
          3 |        153       19.87       87.66
          4 |         40        5.19       92.86
          5 |         19        2.47       95.32
          6 |          8        1.04       96.36
          7 |         13        1.69       98.05
          8 |         10        1.30       99.35
          9 |          1        0.13       99.48
         13 |          1        0.13       99.61
         14 |          3        0.39      100.00
------------+-----------------------------------
      Total |        770      100.00

Reported fever episode length (untruncated)

      fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        252       32.73       32.73
          2 |        270       35.06       67.79
          3 |        153       19.87       87.66
          4 |         40        5.19       92.86
          5 |         19        2.47       95.32
          6 |          8        1.04       96.36
          7 |         13        1.69       98.05
          8 |         10        1.30       99.35
          9 |          1        0.13       99.48
         13 |          1        0.13       99.61
         22 |          1        0.13       99.74
         92 |          2        0.26      100.00
------------+-----------------------------------
      Total |        770      100.00

Mean Fever episode length

                 fever episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs                 768
25%            1              1       Sum of Wgt.         768

50%            2                      Mean           2.303385
                        Largest       Std. Dev.      1.634181
75%            3              8
90%            4              9       Variance       2.670549
95%            5             13       Skewness       3.832216
99%            8             22       Kurtosis       34.05909
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     fever00 |      3708    .0307443    .1726475          0          1
     fever01 |      3708     .061219    .2397639          0          1
     fever02 |      3708    .0658037     .247972          0          1
     fever03 |      3708    .0690399    .2535562          0          1
     fever04 |      3708    .0566343    .2311737          0          1
-------------+--------------------------------------------------------
     fever05 |      3708    .0606796    .2387739          0          1
     fever06 |      3708    .0752427    .2638182          0          1
     fever07 |      3708    .0892665    .2851664          0          1
     fever08 |      3708      .03452    .1825851          0          1
     fever09 |      3708    .0213053    .1444195          0          1
-------------+--------------------------------------------------------
     fever10 |      3708    .0194175    .1380057          0          1
     fever11 |      3708    .0132147    .1142084          0          1
     fever12 |      3708    .0175297    .1312518          0          1
     fever13 |      3708      .01726    .1302561          0          1
     fever14 |      3708    .0177994    .1322394          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   fever01pp |      3708     .061219    .2397639          0          1
   fever02pp |      3708    .0895361    .2855546          0          1
   fever03pp |      3708    .1194714    .3243861          0          1
   fever04pp |      3708    .1413161    .3483943          0          1
   fever05pp |      3708    .1699029    .3755981          0          1
-------------+--------------------------------------------------------
   fever06pp |      3708    .2009169    .4007401          0          1
   fever07pp |      3708    .2346278    .4238231          0          1
   fever08pp |      3708    .2448759    .4300716          0          1
   fever09pp |      3708    .2502697    .4332267          0          1
   fever10pp |      3708    .2553937    .4361411          0          1
-------------+--------------------------------------------------------
   fever11pp |      3708    .2594391     .438386          0          1
   fever12pp |      3708    .2669903    .4424469          0          1
   fever13pp |      3708     .271575    .4448318          0          1
   fever14pp |      3708    .2742718    .4462068          0          1

. 
. 
. * SENEGAL
. use "~/dropbox/articles/wsp-recall/data/wsp-recall-data.dta", clear
(WSP Baseline, recall article dataset)

. keep if dataset=="Senegal"
(10017 observations deleted)

. feversum

Reported fever episode length

      Fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         51        7.62        7.62
          2 |        122       18.24       25.86
          3 |        148       22.12       47.98
          4 |        136       20.33       68.31
          5 |         72       10.76       79.07
          6 |         38        5.68       84.75
          7 |         35        5.23       89.99
          8 |         23        3.44       93.42
          9 |          7        1.05       94.47
         10 |         15        2.24       96.71
         11 |          2        0.30       97.01
         12 |          3        0.45       97.46
         13 |          1        0.15       97.61
         14 |         16        2.39      100.00
------------+-----------------------------------
      Total |        669      100.00

Reported fever episode length (untruncated)

      fever |
    episode |
    length, |
       days |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         51        7.62        7.62
          2 |        122       18.24       25.86
          3 |        148       22.12       47.98
          4 |        136       20.33       68.31
          5 |         72       10.76       79.07
          6 |         38        5.68       84.75
          7 |         35        5.23       89.99
          8 |         23        3.44       93.42
          9 |          7        1.05       94.47
         10 |         15        2.24       96.71
         11 |          2        0.30       97.01
         12 |          3        0.45       97.46
         13 |          1        0.15       97.61
         14 |          9        1.35       98.95
         17 |          1        0.15       99.10
         18 |          1        0.15       99.25
         22 |          1        0.15       99.40
         37 |          1        0.15       99.55
         41 |          1        0.15       99.70
         48 |          1        0.15       99.85
         98 |          1        0.15      100.00
------------+-----------------------------------
      Total |        669      100.00

Mean Fever episode length

                 fever episode length, days
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            2              1       Obs                 665
25%            2              1       Sum of Wgt.         665

50%            4                      Mean           4.160902
                        Largest       Std. Dev.      2.649103
75%            5             14
90%            7             17       Variance       7.017746
95%            9             18       Skewness       2.016944
99%           14             22       Kurtosis       9.442496
Point prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     fever00 |      2174    .0924563    .2897357          0          1
     fever01 |      2174    .1803128    .3845362          0          1
     fever02 |      2174    .2092916    .4068965          0          1
     fever03 |      2174    .2097516    .4072249          0          1
     fever04 |      2174    .2074517    .4055751          0          1
-------------+--------------------------------------------------------
     fever05 |      2174    .1936523    .3952504          0          1
     fever06 |      2174     .175713    .3806633          0          1
     fever07 |      2174    .1582337    .3650439          0          1
     fever08 |      2174    .1274149    .3335139          0          1
     fever09 |      2174    .1071757    .3094077          0          1
-------------+--------------------------------------------------------
     fever10 |      2174    .0970561    .2961023          0          1
     fever11 |      2174    .0694572    .2542885          0          1
     fever12 |      2174    .0708372    .2566117          0          1
     fever13 |      2174    .0662374    .2487537          0          1
     fever14 |      2174    .0616375    .2405514          0          1
Period prevalence means

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
   fever01pp |      2174    .1803128    .3845362          0          1
   fever02pp |      2174    .2341306    .4235516          0          1
   fever03pp |      2174     .275529    .4468832          0          1
   fever04pp |      2174    .3173873    .4655666          0          1
   fever05pp |      2174    .3468261    .4760693          0          1
-------------+--------------------------------------------------------
   fever06pp |      2174     .375805    .4844415          0          1
   fever07pp |      2174    .3983441    .4896696          0          1
   fever08pp |      2174    .4190432     .493516          0          1
   fever09pp |      2174    .4282429     .494938          0          1
   fever10pp |      2174    .4415823    .4966899          0          1
-------------+--------------------------------------------------------
   fever11pp |      2174     .448942    .4975007          0          1
   fever12pp |      2174    .4599816    .4985106          0          1
   fever13pp |      2174    .4696412    .4991923          0          1
   fever14pp |      2174    .4714811    .4993009          0          1

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/benarnold/dropbox/articles/wsp-recall/programs/final/1-descri
> ptive/3-wsp-fever-diagnostics.log
  log type:  text
 closed on:  24 May 2012, 12:16:26
---------------------------------------------------------------------------------
